# 1. Вычислить число c заданной точностью d

# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
# 3.141592653589793

from math import pi

accuracy = input("Введите число для заданной точности числа Пи:\n")
# введеное число преобразовываем в список строк, split('.') разделяет основную строку
# по разделителю и возвращает список строк. Измеряем длину позиции [1]
d = len(str(accuracy).split('.')[1])

# Второй вариант: find('.') узнаем позицию ".", вычитаем длину введеной строки "- 1" (длина символа .)
# d = int(abs(accuracy.find('.') - len(accuracy)) - 1)

print(f'число Пи с заданной точностью d = {accuracy} равно {str(pi)[:d+2]}')
